{"original_title":"Malicious AI extensions on VSCode Marketplace steal developer data","original_url":"https://www.bleepingcomputer.com/news/security/malicious-ai-extensions-on-vscode-marketplace-steal-developer-data/","selection_reasoning":"This represents a compelling tale of betrayal within trusted spaces - craftsmen's tools corrupted from within their own guild halls. The scale (1.5M installations) and the targeting of developers (those who build the digital realm) offers rich narrative potential about trust, verification, and how corruption spreads through the very foundations of creation.","field_note":{"title":"The Corrupted Craftsmen's Tools","subtitle":"When the guild's own forges birth instruments of betrayal","readTime":3,"excerpt":"In the grand marketplace where craftsmen gather their enchanted tools, corruption took root in the very instruments meant to aid creation.","tags":["supply-chain","trusted-spaces","verification"],"epigraph":"Trust is built in drops and lost in <em>buckets</em>","body_paragraphs":["In the grand marketplace where craftsmen gather their enchanted tools, corruption took root in the very instruments meant to aid creation. Two false implements, disguised as helpful companions promising to enhance the craft of code-weaving, found their way into the hands of one and a half million builders. These tools, bearing the masks of assistants for the mystical arts of artificial wisdom, carried within them a darker purpose.","The corrupted instruments performed their promised functions well enough to avoid suspicion, yet beneath their helpful facade, they quietly gathered the secrets of their wielders. Names, workshop locations, the intimate details of ongoing projects-all flowed like stolen silver through hidden channels to distant kingdoms across the eastern seas. The craftsmen worked unknowing, their trust absolute in the sanctity of their guild's marketplace.","What strikes deepest is not merely the breach itself, but the sacred nature of what was violated. These were not common merchants hawking dubious wares in shadowed alleys, but tools endorsed by the guild's own hall, marked with seals of approval and counted among the most popular implements of their kind. The corruption had not forced its way in through broken walls-it had walked through the front gates wearing the robes of legitimacy.","The lesson echoes through chambers both ancient and digital: verification cannot end at the threshold. Even within trusted halls, especially within trusted halls, vigilance must persist. For when the very tools that build our world become vessels of betrayal, the foundations themselves grow uncertain beneath our feet."],"has_hr":false,"slug":"corrupted-craftsmens-tools"}}