{"original_title":"Malicious npm Packages Harvest Crypto Keys, CI Secrets, and API Tokens","original_url":"https://thehackernews.com/2026/02/malicious-npm-packages-harvest-crypto.html","selection_reasoning":"Supply chain attacks represent one of the most insidious forms of breach, involving trusted trade routes being corrupted. The 'Shai-Hulud' campaign name and worm-like behavior creates rich metaphorical material around corruption spreading through trusted networks.","field_note":{"title":"The Merchant's Corrupted Caravan","subtitle":"How trusted trade routes become vectors of silent theft","readTime":3,"excerpt":"Nineteen corrupted supply bundles spread like a desert worm through the realm's most trusted trade networks, harvesting the very keys meant to secure merchant treasuries.","tags":["supply-chain","credential-harvesting","trusted-systems"],"epigraph":"The most dangerous thief is the one who wears the merchant's <em>seal</em>.","body_paragraphs":["The chroniclers have given it a name drawn from ancient desert lore: the Sandworm-a creature that moves unseen beneath trusted ground, emerging only when the damage is done. In this season's telling, nineteen corrupted bundles found their way into the realm's most essential trade network, the great repository where artisans and builders source their materials.","What makes this incursion particularly insidious is its method of propagation. Like the mythical desert beast, each corrupted bundle contained the means to corrupt others, spreading through the very channels that kingdoms depend upon for prosperity. The thieves showed remarkable patience, crafting their deception to appear as legitimate goods-tools and components that builders genuinely needed.","The stolen treasures reveal the attackers' true sophistication: not mere coin, but the cryptographic keys that secure merchant vaults, the sealed writs that authenticate trade agreements, and the secret tokens that grant access to the realm's most sensitive administrative systems. These are the instruments of trust itself, the invisible foundations upon which all secure commerce rests.","This pattern has emerged before in the archives-what the scholars call the 'Shai-Hulud waves'-suggesting we face not isolated brigandage but a coordinated campaign of systematic infiltration. Each wave grows more refined, more patient, more dangerous. The lesson burns clear: in an age where prosperity depends upon vast networks of trusted exchange, the corruption of that trust becomes the most valuable prize of all."],"has_hr":true,"slug":"the-merchants-corrupted-caravan"}}